package com.company;

import java.util.Random;

//Для проверки остаточных знаний учеников после летних каникул,
//учитель младших классов решил начинать каждый урок с того,
//чтобы задавать каждому ученику пример из таблицы умножения,
//но в классе 15 человек, а примеры среди них не должны повторяться.
//В помощь учителю напишите программу,
//которая будет выводить на экран 15 случайных примеров из таблицы умножения
//(от 2*2 до 9*9, потому что задания по умножению на 1 и на 10 — слишком просты).
//При этом среди 15 примеров не должно быть повторяющихся
//(примеры 2*3 и 3*2 и им подобные пары считать повторяющимися).
public class pzdc {
    public static void main(String[] args) {
        int s = (int) (Math.random() * 9) +2;
        System.out.println(s);
    }
}

            /*for(int i = 0; i < arr.length; i++){
        System.out.println("");
        for(int j = 0; j < arr[i].length-1; j++){
        arr[i][j] = (int) (Math.random() * 10);
        System.out.print(arr[i][j] + " ");
        }
        */