package com.company;
//Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
public class zd3 {
    public static void main(String[] args) {
        for(int a = 95; a>=0; a = a-5){
            System.out.print(a + " ");
        }
    }
}
